Repository: Alan86024/NVDAAutoclip-
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, fi, tr

source: Autoclip
fi: Automaattinen leikepöydän puhuminen
tr: Otomatik Pano

source: Toggles Autoclip, Automatic clipboard reading.
ar: يبدل بين تفعيل وتعطيل Autoclip, القراءة التلقائية للحافظة.
fi: Ottaa käyttöön tai poistaa käytöstä Automaattinen leikepöydän puhuminen -lisäosan.
tr: Otomatik klip, Otomatik pano okuma arasında geçiş yapar.

source: Toggles if Autoclip should interrupt speech before speaking the clipboard
ar: يقوم بتبديل إذا كان يجب على Autoclip أن يقاطع الكلام قبل نطق محتوى الحافظة.
fi: Määrittää, keskeytetäänkö puhe ennen leikepöydän sisällön puhumista
tr: Autoclip'in panoya konuşmadan önce konuşmayı kesmesi gerekip gerekmediğini değiştirir

source: Enabled "Interrupt before speaking the clipboard"
ar: تم تمكين مقاطعة النطق قبل قرائة محتوى الحافظة
fi: Puhe keskeytetään ennen leikepöydän puhumista
tr: "Panoya seslenmeden önce ara ver" etkinleştirildi

source: Disabled "Interrupt before speaking the clipboard"
ar: تم تعطيل مقاطعة النطق قبل قرائة محتوى الحافظة
fi: Puhetta ei keskeytetä ennen leikepöydän puhumista
tr: "Panoya seslenmeden önce ara ver" devre dışı bırakıldı

source: Enabled Automatic Clipboard Reading.
ar: تم تفعيل القراءة التلقائية للحافظة.
fi: Automaattinen leikepöydän puhuminen käytössä
tr: Otomatik Pano Okuma Etkinleştirildi.

source: Disabled Automatic Clipboard Reading.
ar: تم تعطيل القرائة التلقائية للحافظة.
fi: Automaattinen leikepöydän puhuminen ei käytössä
tr: Otomatik Pano Okuması Devre Dışı Bırakıldı.

source: &Automatic clipboard reading
ar: قراءة ال&حافظة تلقائيًا
fi: &Automaattinen leikepöydän puhuminen
tr: &Otomatik pano okuma

source: Always &Interrupt before speaking the clipboard
ar: &ايقاف النطق دائمًا قبل قراءة محتوى الحافظة
fi: &Keskeytä ennen leikepöydän sisällön puhumista
tr: Panoya konuşmadan önce her zaman &Araya gir

source: &Remember automatic clipboard reading after NVDA restart. Required for use in configuration profiles
fi: &Muista automaattisen leikepöydän puhumisen tila NVDA:n uudelleenkäynnistyksen jälkeen

source: &Show in the NVDA tools menu
ar: إ&ظهار في قائمة أدوات NVDA
fi: &Näytä NVDA:n Työkalut-valikossa
tr: NVDA araçları menüsünde &Göster

source: Advanced Settings
fi: Lisäasetukset

source: Split text above this length to segments spoken separately (number under 100 to disable):
fi: Jaa teksti erillisiin osiin (alle 100 oleva arvo poistaa käytöstä):

source: When splitting text, try to split segments at word boundaries
fi: Pyri katkaisemaan osat sanan rajakohdissa

source: Maximum text length to speak (characters):
fi: Puhuttavan tekstin enimmäispituus (merkkeinä):

source: Debounce Delay to not speaking a clipboard update with the same text (milliseconds) (0 to disable and never filter extra equivalent clipboard updates) (-1 to never speak an equivalent clipboard update:
fi: Saman tekstin estämisen viive (0 poistaa käytöstä, −1 estää saman sisällön puhumisen kokonaan):

source: Minimum delay between speech interrupts (milliseconds) (0 to disable and to always interrupt):
fi: Vähimmäisaika puheen keskeytysten välillä (millisekunteina, 0 poistaa rajoituksen ja sallii keskeytykset aina):

source: Restore advanced settings to &defaults
fi: Palauta &oletukset

source: Autoclip, automatically speak clipboard content when it changes
ar: Autoclip, نطق محتوى الحافظة تلقائيًا عندما يتغير
fi: Automaattinen leikepöydän puhuminen: puhuu automaattisesti leikepöydän sisällön sen muuttuessa
tr: Autoclip, pano içeriğini değiştiğinde otomatik olarak seslendirir

source: Automatically read the contents of the clipboard when a change is detected. Press NVDA + Shift + Control + K to toggle.
ar: يقرأ النص الموجود في الحافظة تلقائيًا عندما يتغير. قم بضغط "NVDA + Shift + Control + K" للتشغيل والتعطيل.
fi: Puhu leikepöydän sisältö automaattisesti muutoksia havaittaessa. Ota lisäosa käyttöön tai poista se käytöstä painamalla NVDA+Vaihto+Ctrl+K.
tr: Bir değişiklik algılandığında panonun içeriğini otomatik olarak okuyun. Geçiş yapmak için NVDA + Shift + Control + K tuşlarına basın.

source: &Remember automatic clipboard reading after NVDA restart. Required for use in configuration profiles
ar: تذكر &حالة القراءة التلقائية للحافظة بعد إعادة تشغيل NVDA. يجب تمكين هذا الخيار لاستخدام الاضافة في الأوضاع
tr: &NVDA yeniden başlatıldıktan sonra otomatik pano okumasını hatırla. Yapılandırma profillerinde kullanım için gereklidir
